In [6]:
# Import libraries
import pandas as pd
import numpy as np
import re

# Don't display too many rows/cols of DataFrames
pd.options.display.max_rows = 7
pd.options.display.max_columns = 10

In [7]:
# Load crime data
df_crime = pd.read_csv('UScrime_scraped.csv')
df_crime

,Unnamed: 0,Unnamed: 0.1,city,state,20th,...,autotheftsper100k,arson,arsonper100k,crime index,income inequality
0,0,0,Alabaster,Alabama,33578,...,63.2,NaN,NaN,115.9,143781
1,1,1,Albertville,Alabama,17270,...,416.9,NaN,NaN,200.0,111105
2,2,2,Anniston,Alabama,12553,...,501.0,NaN,NaN,1302.8,131285
...,...,...,...,...,...,...,...,...,...,...,...
921,921,921,Sheridan,Wyoming,20786,...,110.9,2.0,11.1,101.1,131543
922,922,922,Torrington,Wyoming,18806,...,44.6,0.0,0.0,91.5,135671
923,923,923,Worland,Wyoming,20148,...,56.7,0.0,0.0,118.4,145338

In [3]:
# Load income data
df_income = pd.read_csv('economic_data.csv')
df_income

,Unnamed: 0,place,percentile,income,percent
0,0,https://statisticalatlas.com/place/Alabama/Ala...,95th,"0 177,359.000000\rdtype: object",0 241.881\rdtype: object
1,1,https://statisticalatlas.com/place/Alabama/Ala...,80th,"0 122,176.000000\rdtype: object",0 166.623\rdtype: object
2,2,https://statisticalatlas.com/place/Alabama/Ala...,60th,"0 85,277.000000\rdtype: object",0 116.300\rdtype: object
...,...,...,...,...,...
10869,3,https://statisticalatlas.com/place/Wyoming/Pow...,Median,"0 46,971.000000\rdtype: object",0 100.000\rdtype: object
10870,4,https://statisticalatlas.com/place/Wyoming/Pow...,40th,"0 40,583.000000\rdtype: object",0 86.400\rdtype: object
10871,5,https://statisticalatlas.com/place/Wyoming/Pow...,20th,"0 23,336.000000\rdtype: object",0 49.682\rdtype: object

In [4]:
# Extract city and state from url
df_income['citystate'] = df_income['place'].str.extract("place/(.*)/")
df_income['citystate']

0        Alabama/Alabaster
1        Alabama/Alabaster
2        Alabama/Alabaster
               ...
10869       Wyoming/Powell
10870       Wyoming/Powell
10871       Wyoming/Powell
Name: citystate, Length: 10872, dtype: object

In [5]:
# Extract state
df_income['state'] = df_income['citystate'].str.extract("(.*)/")
df_income['state']

0        Alabama
1        Alabama
2        Alabama
          ...
10869    Wyoming
10870    Wyoming
10871    Wyoming
Name: state, Length: 10872, dtype: object

In [6]:
# Extract city
df_income['city'] = df_income['citystate'].str.extract("/(.*)")
df_income['city']

0        Alabaster
1        Alabaster
2        Alabaster
           ...
10869       Powell
10870       Powell
10871       Powell
Name: city, Length: 10872, dtype: object

In [7]:
# Remove place and citystate columns
df_income = df_income.drop(['place', 'citystate'], axis=1)
df_income

,Unnamed: 0,percentile,income,percent,state,city
0,0,95th,"0 177,359.000000\rdtype: object",0 241.881\rdtype: object,Alabama,Alabaster
1,1,80th,"0 122,176.000000\rdtype: object",0 166.623\rdtype: object,Alabama,Alabaster
2,2,60th,"0 85,277.000000\rdtype: object",0 116.300\rdtype: object,Alabama,Alabaster
...,...,...,...,...,...,...
10869,3,Median,"0 46,971.000000\rdtype: object",0 100.000\rdtype: object,Wyoming,Powell
10870,4,40th,"0 40,583.000000\rdtype: object",0 86.400\rdtype: object,Wyoming,Powell
10871,5,20th,"0 23,336.000000\rdtype: object",0 49.682\rdtype: object,Wyoming,Powell

In [8]:
# Reorder columns
df_income = df_income[['Unnamed: 0', 'city', 'state', 'percentile', 'income', 'percent']]
df_income

,Unnamed: 0,city,state,percentile,income,percent
0,0,Alabaster,Alabama,95th,"0 177,359.000000\rdtype: object",0 241.881\rdtype: object
1,1,Alabaster,Alabama,80th,"0 122,176.000000\rdtype: object",0 166.623\rdtype: object
2,2,Alabaster,Alabama,60th,"0 85,277.000000\rdtype: object",0 116.300\rdtype: object
...,...,...,...,...,...,...
10869,3,Powell,Wyoming,Median,"0 46,971.000000\rdtype: object",0 100.000\rdtype: object
10870,4,Powell,Wyoming,40th,"0 40,583.000000\rdtype: object",0 86.400\rdtype: object
10871,5,Powell,Wyoming,20th,"0 23,336.000000\rdtype: object",0 49.682\rdtype: object

In [9]:
# Remove zeroes in income and percent columns
df_income['income'] = df_income['income'].replace({'0 ':''}, regex = True)
df_income['percent'] = df_income['percent'].replace({'0 ':''}, regex = True)
df_income

,Unnamed: 0,city,state,percentile,income,percent
0,0,Alabaster,Alabama,95th,"177,359.000000\rdtype: object",241.881\rdtype: object
1,1,Alabaster,Alabama,80th,"122,176.000000\rdtype: object",166.623\rdtype: object
2,2,Alabaster,Alabama,60th,"85,277.000000\rdtype: object",116.300\rdtype: object
...,...,...,...,...,...,...
10869,3,Powell,Wyoming,Median,"46,971.000000\rdtype: object",100.000\rdtype: object
10870,4,Powell,Wyoming,40th,"40,583.000000\rdtype: object",86.400\rdtype: object
10871,5,Powell,Wyoming,20th,"23,336.000000\rdtype: object",49.682\rdtype: object

In [10]:
# Convert income to int
pd.options.mode.chained_assignment = None 
for i in range(0, len(df_income)):
    incomeConvert = df_income['income'][i]
    incomeConvert = incomeConvert[:(incomeConvert.find("."))]
    incomeConvert = incomeConvert.replace(',', "")
    incomeConvert = re.sub(r"^\s+", "", incomeConvert, flags=re.UNICODE)
    
    incomeConvert = int(float(incomeConvert))
    df_income['income'][i] = incomeConvert
    #print(incomeConvert)

In [11]:
# Make percentile columns 95th, 80th, 60th, Median, 40th, 20th
#percentile = df_income.pivot_table(index=["city","state","percent"], columns='percentile', values=['income'], aggfunc='first')
#percentile.columns = percentile.columns.droplevel()
#percentile = percentile.reset_index()
#percentile.columns=percentile.columns.tolist()
#percentile

In [12]:
# Drop 'percent' column
# Make percentile columns 20th, 40th, Median, 60th, 80th, 95th
df_percentile = df_income.pivot_table(index=["state","city"], columns='percentile', values=['income'], aggfunc='first')
df_percentile.columns = df_percentile.columns.droplevel()
df_percentile = df_percentile.reset_index()
df_percentile.columns=df_percentile.columns.tolist()
df_percentile = df_percentile[['city','state','20th','40th','Median','60th','80th','95th']]
df_percentile

                city    state   20th   40th  Median   60th    80th    95th
0          Alabaster  Alabama  33578  61734   73325  85277  122176  177359
1        Albertville  Alabama  17270  27280   32042  43119   73798  128375
2     Alexander-City  Alabama  13295  23247   30442  38488   65625  133750
...              ...      ...    ...    ...     ...    ...     ...     ...
1567        Sheridan  Wyoming  20786  37456   48804  61526   95356  152329
1568      Torrington  Wyoming  18806  36662   41959  50048   86015  154477
1569         Worland  Wyoming  20148  32634   39904  52766   80107  165486

[1570 rows x 8 columns]

In [13]:
# Merge the two dataframes
#df = pd.merge(df_income, df_crime, on='Unnamed: 0') 
#df

In [14]:
# Merge income percentile dataframe with crime dataframe
df = pd.merge(df_percentile, df_crime, on=['city','state'])
df = df.drop(['Unnamed: 0'], axis=1)
df

,city,state,20th,40th,Median,...,autothefts,autotheftsper100k,arson,arsonper100k,crime index
0,Alabaster,Alabama,33578,61734,73325,...,21.0,63.2,NaN,NaN,115.9
1,Albertville,Alabama,17270,27280,32042,...,90.0,416.9,NaN,NaN,200.0
2,Anniston,Alabama,12553,22337,30539,...,110.0,501.0,NaN,NaN,1302.8
...,...,...,...,...,...,...,...,...,...,...,...
921,Sheridan,Wyoming,20786,37456,48804,...,20.0,110.9,2.0,11.1,101.1
922,Torrington,Wyoming,18806,36662,41959,...,3.0,44.6,0.0,0.0,91.5
923,Worland,Wyoming,20148,32634,39904,...,3.0,56.7,0.0,0.0,118.4

In [15]:
# Create inequality column: 95th minus 20th
inequality = [0]*len(df)
for i in range(0,len(df)):
    inequality[i] = df['95th'][i] - df['20th'][i]

df['income inequality'] = inequality  
df

,city,state,20th,40th,Median,...,autotheftsper100k,arson,arsonper100k,crime index,income inequality
0,Alabaster,Alabama,33578,61734,73325,...,63.2,NaN,NaN,115.9,143781
1,Albertville,Alabama,17270,27280,32042,...,416.9,NaN,NaN,200.0,111105
2,Anniston,Alabama,12553,22337,30539,...,501.0,NaN,NaN,1302.8,131285
...,...,...,...,...,...,...,...,...,...,...,...
921,Sheridan,Wyoming,20786,37456,48804,...,110.9,2.0,11.1,101.1,131543
922,Torrington,Wyoming,18806,36662,41959,...,44.6,0.0,0.0,91.5,135671
923,Worland,Wyoming,20148,32634,39904,...,56.7,0.0,0.0,118.4,145338

In [16]:
df.to_csv('income_crime.csv')